_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_4 (Dense)              (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  0

Test loss: 0.28346284328740395
Test accuracy: 0.9347284505423112

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_5 (Dense)              (None, 128)               32896     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_4 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_8 (Dense)              (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  1

Test loss: 0.28039671778103487
Test accuracy: 0.9342301944386739

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_9 (Dense)              (None, 128)               32896     
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_6 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_12 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  2

Test loss: 0.26514795637867256
Test accuracy: 0.9377179871641348

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_8 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_16 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  3

Test loss: 0.28193324309178386
Test accuracy: 0.9357249627495857

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_17 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_9 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_10 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_20 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  4

Test loss: 0.2746941654515552
Test accuracy: 0.9412057798895958

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_21 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_11 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_12 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_24 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  5

Test loss: 0.2695891313833952
Test accuracy: 0.9367214749568603

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_25 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_13 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_26 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_14 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_28 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  6

Test loss: 0.2633798528721581
Test accuracy: 0.943697060407782

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_29 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_15 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_16 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_32 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  7

Test loss: 0.2634094753741149
Test accuracy: 0.936223218853223

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_33 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_17 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_34 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_18 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_35 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_36 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  8

Test loss: 0.274005236706451
Test accuracy: 0.9412057798895958

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_37 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_19 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_38 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_20 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_40 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  9

Test loss: 0.28227870675443295
Test accuracy: 0.9382162432677721

Loss Statistics
count    10.000000
mean      0.273830
std       0.008061
min       0.263380
25%       0.266258
50%       0.274350
75%       0.281549
max       0.283463
dtype: float64

Accuracy Statistics
count    10.000000
mean      0.937967
std       0.003127
min       0.934230
25%       0.935850
50%       0.937220
75%       0.940458
max       0.943697
dtype: float64
