_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_4 (Dense)              (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  0

Test loss: 0.2818953244059194
Test accuracy: 0.9397110115786839

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_5 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_6 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_7 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_8 (Dense)              (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  1

Test loss: 0.2828247671734354
Test accuracy: 0.9382162432677721

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_9 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_10 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_11 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_12 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  2

Test loss: 0.27321456129211186
Test accuracy: 0.9422022920968702

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_14 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_15 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_16 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  3

Test loss: 0.2776268703438895
Test accuracy: 0.9342301944386739

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_17 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_18 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_19 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_20 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  4

Test loss: 0.2936233393509195
Test accuracy: 0.9397110115786839

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_21 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_22 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_23 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_24 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  5

Test loss: 0.27632324095011707
Test accuracy: 0.9382162432677721

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_25 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_26 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_27 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_28 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  6

Test loss: 0.2893485995997941
Test accuracy: 0.9342301944386739

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_29 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_30 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_31 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_32 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  7

Test loss: 0.2791987380164146
Test accuracy: 0.9407075237859585

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_33 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_34 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_35 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_36 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  8

Test loss: 0.27660590829350906
Test accuracy: 0.9377179871641348

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_37 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_38 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_39 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_40 (Dense)             (None, 10)                1290      
=================================================================
Total params: 67,210
Trainable params: 67,210
Non-trainable params: 0
_________________________________________________________________
Test Run:  9

Test loss: 0.2980984264681247
Test accuracy: 0.9337319383350366

Loss Statistics
count    10.000000
mean      0.282876
std       0.008211
min       0.273215
25%       0.276861
50%       0.280547
75%       0.287718
max       0.298098
dtype: float64

Accuracy Statistics
count    10.000000
mean      0.937867
std       0.002934
min       0.933732
25%       0.935102
50%       0.938216
75%       0.939711
max       0.942202
dtype: float64
